BankXml/RTGS_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.com" xmlns:ns3="http://strukturaRtgsNaloga.com" xmlns:ns4="http://mt102.BankXml.bankXml.example.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>M8AT7RVM9WYcw/Qwv+pPZAPoTn7Pa1AezNcG0Ab/Rndm4QVN72RaKxdBC0s5lYbeImroDckGWv9c&#13;
db5U8e17VOY8h0yd08qdZMwQ9uEyR8k0u4SB/QjOZZyTLzsK5XZB5Ph8iKyDvAyxyT+6l7YNG1us&#13;
eREmBYxzYmfIHJ5FcWI=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>tSU3+s7I+Mhbr2OX5OsJ9zFpKyomFNK+6nVTt1PxqZbCjDZMOZZ+5E/YzE021HRsM1ejSfxhbU5D&#13;
g9JZCGyaMS4m019PAHi+3+2wUqN4Vvx5Jbu45dMT4zI2vS+NSux8QJh8mizg5rpB808BSilXrlE5&#13;
XieJALToYOWjfy4k2srTf7NIoFTw6b4k3zZekWHHYMAdmD0sl+09XNb+rBWn3yTvNOT8tsgdSoYa&#13;
2XQe+aQ96bB6yDcr5QoAeo/y3/gEPcXjQ+HkocpM+/Fmd74pfy3XRo1i+2bDXIPXCzkihvIEvMYM&#13;
rd5+bBlm0EU3ucyLH3QcMqyfJI/CtxCBZqmT5iGCBID0bNQ9UieslQCOs5JDRphKXKCv8RHbn1w8&#13;
TlVHp2AQ5yGC8TdqMkL7XfFWKyBtA5GktvXXdSQfRnfOFzwmdmKFF5fHG/zwKAVcAH5k0NcAvizj&#13;
R33QR8T18E4hQWVefrwF5EdcY9Su9UIwRWtOjx6aoX7WkYDGIU42EyyUvv155G0WoxTKAQwFco4X&#13;
MfOazk6ZjUiufsN0EmZuVOMeQSgjx50TcqPywCaJ51sL+Bhvk5wOcmSfiDWa8uFAZ4TQyqdZVYw+&#13;
fR/v2iuvMEfQjFGSGJyveuVDUvKhJqi7N1aWKXj798ffpdbdX6FJ9Q9r9Sjrtp9LcdGbTgFTFmlL&#13;
7iZV9qYXSdj+irEyXhWYxyLHiX+tZPqs+lTQYwMTyqtKnF4sXUkuPh/Jql5yUI2DdHkzwro5Pjln&#13;
g6G9a3zmO1xSJPdIFLQAkJVVcdWc0i8usMx/jIGDQMs3Hh9rf3IQ/JXDmvxFO6B4CdREp+hhdpps&#13;
ZmeHGz9BT1E2oZEI9BrhuFQIysZaPBJniYYosEGPxe59dc24aWoR/cmhuCJcZ51s+BYnJ6PPseLK&#13;
Ak+xJ06Ryp/kxaYW53ImJe1Ex476xCSKE3tOuYJG331BhcjuHKdnYssO8h4qwRjFgFpIwA3ekXr5&#13;
3pc4x1pe8NJNYrQebS0YhwIuAEwyS65RCwRjtJ/FlA1xZRK7oKkVOmYWIGhf7/MLb4QtopvF03nT&#13;
Zdt05fVwWKr3A+cW6wj2mmW3lVBUScM7ILHi+ysS3cD5f4XEFcVH134ekM0rf0MDiLC9jNF3cCz2&#13;
fs2yZrWtdcS7clLuQGO2IaiqyTpiwMPIb+FM0dEyIjaFVLOXHYuxQ2XAW0G4IZG7UD7jTwsb1quC&#13;
AvBMkORUE0+h/nUC+jIklIO7ENcue2hL5pJf62O8hE/6dOQqHuZvyGhp4X0t3uk2ATzWMJts0uSG&#13;
xWGy+cB4q3cWMQk1rl4X3EauMOtxnO0yJ20GUWwqXLN42qNEd1RV1WYD779wtAbkSJAErVPs3A==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>LDB/UrP0ZLmVJjhJ2Eo/j0ruBBI=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
rYfNzEx8xdTH1gd22REbcF0ZQABT2CdOMjCz1+VijQqE/ciwzjeV7IiLA8oOEZMxhIIQ9DW/XD+z&#13;
B5+5shhxNuS0s4TR/BBZiY4avjLMKp2VLvbSTJRds8DS6qeGTULaNInnAb2A8fwtDl2W3kKd7F5B&#13;
tT6RhdQGPgu4c3B8XoA=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>